/*
Тема: Шаблоны классов
Задание.
Создайте шаблонный класс матрица. Необходимо реализовать динамическое выделение памяти, очистку памяти,
заполнение матрицы с клавиатуры, заполнение случайными значениями, отображение матрицы, арифметические
операции с помощью перегруженных операторов (+, –,
*, /), поиск максимального и минимального элемента.
*/

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}


